Ran Plan for dir: `terraform/atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # kubernetes_secret.tls has been changed
~ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "cert-manager.io/alt-names"        = "pritunl.wayofthesys.com"
              + "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls"
              + "cert-manager.io/common-name"      = "pritunl.wayofthesys.com"
              + "cert-manager.io/ip-sans"          = ""
              + "cert-manager.io/issuer-group"     = "cert-manager.io"
              + "cert-manager.io/issuer-kind"      = "ClusterIssuer"
              + "cert-manager.io/issuer-name"      = "zerossl"
              + "cert-manager.io/uri-sans"         = ""
            }
            name             = "wayofthesys-com-pritunl-tls"
          ~ resource_version = "14762570" -> "14765735"
            # (4 unchanged attributes hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.mongodb must be replaced
-/+ resource "helm_release" "mongodb" {
      ~ id                         = "pritunl-mongodb" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "4.4.13"
              - chart       = "mongodb"
              - name        = "pritunl-mongodb"
              - namespace   = "pritunl"
              - revision    = 2
              - values      = jsonencode(
                    {
                      - auth = {
                          - database     = "pritunl"
                          - password     = "IJfedsdaHHffhd323a"
                          - rootPassword = "IJfedsdaHHffhd323a"
                          - rootUser     = "admin"
                          - username     = "admin"
                        }
                    }
                )
              - version     = "11.1.2"
            },
        ] -> (known after apply)
      ~ name                       = "pritunl-mongodb" -> "mongodb" # forces replacement
      ~ namespace                  = "pritunl" -> "mongodb" # forces replacement
      ~ repository                 = "./helm_charts" -> "https://charts.bitnami.com/bitnami"
      - values                     = [
          - (sensitive),
        ] -> null
        # (23 unchanged attributes hidden)
    }

  # helm_release.pritunl will be updated in-place
~ resource "helm_release" "pritunl" {
        id                         = "pritunl"
        name                       = "pritunl"
      ~ values                     = [
          - <<-EOT
                image:
                  registry: ghcr.io  
                  repository: autotune/pritunl-k8s-tf-do/autotune/pritunl-k8s-tf-do
                  tag: pritunl:dc7700e4 
                  pullPolicy: Always
                  pullSecret: "wayofthesys-com-docker-login"
                  domain_name: "wayofthesys-com"
                
                # This should match whatever the 'mongodb' service is called in the cluster.
                # DNS should be able to resolve the service by this name for Pritunl to function.
                mongoService: "pritunl-mongodb"
                
                # Change these as you see fit.
                ports:
                  http: 80
                  vpn: 1194
                  webui: 80 
                
                # This must be enabled when using Pritunl due to the rights that iptables will need in the Pritunl pods.
                privileged:
                  enabled: true
                
                # This will adjust the replicas that are deployed as a part of the Pritunl deployment.
                # This is '3' by default. Your Pritunl cluster number will be affected by this.
                replicaCount: 3
                
                # If 'type' here is 'LoadBalancer', these annotations are necessary to properly use an ELB if deploying this chart in AWS, so they'll automatically get used.
                # Be sure to add the appropriate domain name, cert ARN, and ssl-negotiation-policy (a default is used here).
                service:
                  annotations:
                  type: ClusterIP
                
                tty:
                  enabled: true
                
                # Health Checks
                livenessProbe:
                  enabled: true
                  initialDelaySeconds: 30
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 6
                  successThreshold: 1
                
                readinessProbe:
                  enabled: true
                  initialDelaySeconds: 5
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 6
                  successThreshold: 1
            EOT,
          + <<-EOT
                image:
                  registry: docker.pkg.github.com
                  repository: autotune/pritunl-k8s-tf-do
                  tag: latest
                  pullPolicy: Always
                
                # This should match whatever the 'mongodb' service is called in the cluster.
                # DNS should be able to resolve the service by this name for Pritunl to function.
                mongoService: "pritunl-mongodb"
                
                # Change these as you see fit.
                ports:
                  http: 80
                  vpn: 1194
                  webui: 443
                
                # This must be enabled when using Pritunl due to the rights that iptables will need in the Pritunl pods.
                privileged:
                  enabled: true
                
                # This will adjust the replicas that are deployed as a part of the Pritunl deployment.
                # This is '3' by default. Your Pritunl cluster number will be affected by this.
                replicaCount: 3
                
                # If 'type' here is 'LoadBalancer', these annotations are necessary to properly use an ELB if deploying this chart in AWS, so they'll automatically get used.
                # Be sure to add the appropriate domain name, cert ARN, and ssl-negotiation-policy (a default is used here).
                service:
                  annotations:
                  type: ClusterIP
                
                tty:
                  enabled: true
                
                # Health Checks
                livenessProbe:
                  enabled: true
                  initialDelaySeconds: 30
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 6
                  successThreshold: 1
                
                readinessProbe:
                  enabled: true
                  initialDelaySeconds: 5
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 6
                  successThreshold: 1
            EOT,
        ]
      ~ version                    = "0.0.8" -> "0.0.1"
        # (25 unchanged attributes hidden)
    }

  # kubernetes_secret.docker_login_secret will be destroyed
- resource "kubernetes_secret" "docker_login_secret" {
      - data      = (sensitive value)
      - id        = "pritunl/wayofthesys-com-docker-login" -> null
      - immutable = false -> null
      - type      = "kubernetes.io/dockerconfigjson" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "wayofthesys-com-docker-login" -> null
          - namespace        = "pritunl" -> null
          - resource_version = "10308648" -> null
          - uid              = "39c14951-3935-491c-a662-1949184c2a29" -> null
        }
    }

  # kubernetes_secret.mongodb_root_password will be destroyed
- resource "kubernetes_secret" "mongodb_root_password" {
      - data      = (sensitive value)
      - id        = "pritunl/mongodb-root-password" -> null
      - immutable = false -> null
      - type      = "kubernetes.io/Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "mongodb-root-password" -> null
          - namespace        = "pritunl" -> null
          - resource_version = "14437265" -> null
          - uid              = "808ed55a-b973-4ef4-be80-746b5bba31aa" -> null
        }
    }

  # kubernetes_secret.tls must be replaced
-/+ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
      ~ id        = "pritunl/wayofthesys-com-pritunl-tls" -> (known after apply)
      - immutable = false -> null
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {
              - "cert-manager.io/alt-names"        = "pritunl.wayofthesys.com"
              - "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls"
              - "cert-manager.io/common-name"      = "pritunl.wayofthesys.com"
              - "cert-manager.io/ip-sans"          = ""
              - "cert-manager.io/issuer-group"     = "cert-manager.io"
              - "cert-manager.io/issuer-kind"      = "ClusterIssuer"
              - "cert-manager.io/issuer-name"      = "zerossl"
              - "cert-manager.io/uri-sans"         = ""
            } -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
          ~ name             = "wayofthesys-com-pritunl-tls" -> "wayofthesys-com-terraform-tls" # forces replacement
          ~ resource_version = "14765735" -> (known after apply)
          ~ uid              = "659f3168-c70e-424f-a02e-14750f65eeba" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # random_id.encryption-key will be destroyed
- resource "random_id" "encryption-key" {
      - b64_std     = "GgDTPO6Oi1yzhAfimiyk5iwBsDYjQHbPLDx7n8lYbns=" -> null
      - b64_url     = "GgDTPO6Oi1yzhAfimiyk5iwBsDYjQHbPLDx7n8lYbns" -> null
      - byte_length = 32 -> null
      - dec         = "11761591974363863710888702749719167498629641427876505890593812923174025195131" -> null
      - hex         = "1a00d33cee8e8b5cb38407e29a2ca4e62c01b036234076cf2c3c7b9fc9586e7b" -> null
      - id          = "GgDTPO6Oi1yzhAfimiyk5iwBsDYjQHbPLDx7n8lYbns" -> null
    }

  # tls_cert_request.request must be replaced
-/+ resource "tls_cert_request" "request" {
      ~ cert_request_pem = <<-EOT
            -----BEGIN CERTIFICATE REQUEST-----
            MIIDBjCCAe4CAQAwNTERMA8GA1UEChMIQXRsYW50aXMxIDAeBgNVBAMTF3ByaXR1
            bmwud2F5b2Z0aGVzeXMuY29tMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKC
            AQEA5lJDYAk0g4CxkJCu6amgCAZ2ISd7rvsuvGJNP+h/BS/6N1VtDxuNm/kVkUGR
            HJ+hjgDI8h0c8B9V5zJsQVf/vohlYFDfzysiME0hwejyXiaPaeSMX0VZRUqVGBNG
            08/MIwGncogGau8Rk5zXoF7tBHjIPMlU5oNorLS95Mfl5FqC/Uz2kARNBcPPPpbp
            gkb9aJymPgIQf9cmIqXqlXQesNMueCyLlXNgy6k9uaLE4TlihNUhUOhKppT+Oi/j
            KCY+tsv5+utzopPimJeb90E+5froxRAjKMlJ0MW+0DHTqsZD2gnmPwnaRZ73wma3
            rZMmUCrWdgNCA2cov/hSRUy8GwIDAQABoIGLMIGIBgkqhkiG9w0BCQ4xezB5MHcG
            A1UdEQRwMG6CCGF0bGFudGlzgg5hdGxhbnRpcy5sb2NhbIIiYXRsYW50aXMuZGVm
            YXVsdC5zdmMuY2x1c3Rlci5sb2NhbIIJbG9jYWxob3N0ghdwcml0dW5sLndheW9m
            dGhlc3lzLmNvbYcEfwAAAYcEisUw9zANBgkqhkiG9w0BAQsFAAOCAQEA1zteii8W
            xXoU420RsJSglP0n7BycQZlQZNpStXRTC0jgtLLGTOtBNVAuCMq8QzjHN7xL6okF
            3NUAJDyah73uqR29Hj2z3Us4olor55I5K0lDAn4Y3NprDWth9ejsYv0eiLhqC0b9
            5BLq+mM5FhKEcEVSlwiymUSxw3StnvCVf2gKDoBKdgd3eyEipayLU7O2ZAvc/AUv
            0DEtcF5gvrApvpE51FE6+CPuoXUjnRTgzXF3H3JZhIGiz/Ayp7P8btO/+KT2lj58
            Nwey93q46AUBQlbll6SMPzuqGf/brbsG3c4PaTmp8eFtKQ9iXUhW/hNxcrqWUJd/
            e6IPU2beys5KvQ==
            -----END CERTIFICATE REQUEST-----
        EOT -> (known after apply)
      ~ dns_names        = [ # forces replacement
            # (3 unchanged elements hidden)
            "localhost",
          - "pritunl.wayofthesys.com",
          + "terraform.wayofthesys.com",
        ]
      ~ id               = "bd65263b60fe87b500efff18a405fa1f641dcdc5" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ subject {
          ~ common_name    = "pritunl.wayofthesys.com" -> "terraform.wayofthesys.com" # forces replacement
          - street_address = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # tls_locally_signed_cert.cert must be replaced
-/+ resource "tls_locally_signed_cert" "cert" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDvzCCAqegAwIBAgIQU3KtzUKiTvWlntHnR4e1BDANBgkqhkiG9w0BAQsFADAl
            MRAwDgYDVQQKEwdQcml0dW5sMREwDwYDVQQDEwhjYS5sb2NhbDAeFw0yMjA0MTky
            MDMwNTRaFw0yMzA0MTkyMDMwNTRaMDUxETAPBgNVBAoTCEF0bGFudGlzMSAwHgYD
            VQQDExdwcml0dW5sLndheW9mdGhlc3lzLmNvbTCCASIwDQYJKoZIhvcNAQEBBQAD
            ggEPADCCAQoCggEBAOZSQ2AJNIOAsZCQrumpoAgGdiEne677LrxiTT/ofwUv+jdV
            bQ8bjZv5FZFBkRyfoY4AyPIdHPAfVecybEFX/76IZWBQ388rIjBNIcHo8l4mj2nk
            jF9FWUVKlRgTRtPPzCMBp3KIBmrvEZOc16Be7QR4yDzJVOaDaKy0veTH5eRagv1M
            9pAETQXDzz6W6YJG/Wicpj4CEH/XJiKl6pV0HrDTLngsi5VzYMupPbmixOE5YoTV
            IVDoSqaU/jov4ygmPrbL+frrc6KT4piXm/dBPuX66MUQIyjJSdDFvtAx06rGQ9oJ
            5j8J2kWe98Jmt62TJlAq1nYDQgNnKL/4UkVMvBsCAwEAAaOB2jCB1zAOBgNVHQ8B
            Af8EBAMCAqQwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMBMAwGA1UdEwEB
            /wQCMAAwHwYDVR0jBBgwFoAUiX7mn7B4BkrbgISk8XecJhMj9owwdwYDVR0RBHAw
            boIIYXRsYW50aXOCDmF0bGFudGlzLmxvY2FsgiJhdGxhbnRpcy5kZWZhdWx0LnN2
            Yy5jbHVzdGVyLmxvY2Fsgglsb2NhbGhvc3SCF3ByaXR1bmwud2F5b2Z0aGVzeXMu
            Y29thwR/AAABhwSKxTD3MA0GCSqGSIb3DQEBCwUAA4IBAQCJnXZZkFrA8AbAhxZz
            fIYbBARiW13Uk5dGrUGxkBdeNdqsMO+fQnYnoXTqyeLR4HOmGnosnD41rgu0q3zp
            NnywD8doUEQHwiysSw66OX5eXGMc46oHIsqoNv0PnvMtMTbR7D475a6iHvUFyC2R
            ajmSsHyajH8tyid9z6JSpIngp7Pga95KiGTOchK++XjOMzmpGpsO8TJmbQ2AtG7v
            yeMZOtx+96rtebbWVYweR3DJ0r4WeTzq14A6NTXYACLo44elrFBwYooMACaxSkC5
            XNnL4HWBijdaulsnLkxd0UC+6ocopWRtq1tlsfpsjENVgZH4UEcxv+6XdBrR7pzT
            YmNo
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ cert_request_pem      = "fe3bd1e0ff62625977693dacce4477b4d9125881" -> (known after apply) # forces replacement
      ~ id                    = "110921370611277964470799525342932874500" -> (known after apply)
      ~ ready_for_renewal     = false -> true
      ~ validity_end_time     = "2023-04-19T20:30:54.793906102Z" -> (known after apply)
      ~ validity_start_time   = "2022-04-19T20:30:54.793906102Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 7 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Warning: Argument is deprecated

  with tls_self_signed_cert.ca,
  on tls.tf line 20, in resource "tls_self_signed_cert" "ca":
  20:   key_algorithm   = tls_private_key.ca.algorithm

This is now ignored, as the key algorithm is inferred from the
`private_key_pem`.

(and 5 more similar warnings elsewhere)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://wayofthesys.com/lock?id=autotune%252Fpritunl-k8s-tf-do%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>
Plan: 4 to add, 1 to change, 7 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
